---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.FlexDuctType
source: html/e2cc57cc-82aa-aba8-a084-9f9a3fdb510e.htm
---
# FlexDuctType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.